import { Card } from 'react-bootstrap'
import Datatable from "../components/ui/Datatable";
import BMIForm from '../components/calories/BMIForm';
import WeightForm from '../components/calories/WeightForm'

const 體重指數 = [
    {
        '': '過輕',
        '男性': '低於20',
        '女性': '低於19'
    },
    {
        '': '適中',
        '男性': '20-25',
        '女性': '19-24'
    },
    {
        '': '過重',
        '男性': '26-30',
        '女性': '25-29'
    },
    {
        '': '肥胖',
        '男性': '30-35',
        '女性': '29-34'
    },
    {
        '': '非常肥胖',
        '男性': '高於35',
        '女性': '高於34'
    },
]

const 女性理想體重表 = [
    {
        "厘米": 155.0,
        "磅 (小骨骼型)": "41-49",
        "磅 (中骨骼型)": "44-48",
        "磅 (大骨骼型)": "47-52"
    },
    {
        "厘米": 157.5,
        "磅 (小骨骼型)": "43-47",
        "磅 (中骨骼型)": "49-50",
        "磅 (大骨骼型)": "49-54"
    },
    {
        "厘米": 160.0,
        "磅 (小骨骼型)": "45-49",
        "磅 (中骨骼型)": "47-52",
        "磅 (大骨骼型)": "51-55"
    },
    {
        "厘米": 162.5,
        "磅 (小骨骼型)": "46-51",
        "磅 (中骨骼型)": "49-54",
        "磅 (大骨骼型)": "53-57"
    },
    {
        "厘米": 165.0,
        "磅 (小骨骼型)": "48-53",
        "磅 (中骨骼型)": "51-55",
        "磅 (大骨骼型)": "54-59"
    },
    {
        "厘米": 167.5,
        "磅 (小骨骼型)": "50-54",
        "磅 (中骨骼型)": "53-57",
        "磅 (大骨骼型)": "56-61"
    },
    {
        "厘米": 170.0,
        "磅 (小骨骼型)": "52-56",
        "磅 (中骨骼型)": "54-59",
        "磅 (大骨骼型)": "58-63"
    }
]

const 男性理想體重表 = [
    {
        "厘米": 170.0,
        "磅 (小骨骼型)": "55-60",
        "磅 (中骨骼型)": "58-64",
        "磅 (大骨骼型)": "62-69"
    },
    {
        "厘米": 172.5,
        "磅 (小骨骼型)": "57-62",
        "磅 (中骨骼型)": "60-65",
        "磅 (大骨骼型)": "64-70"
    },
    {
        "厘米": 175.0,
        "磅 (小骨骼型)": "59-64",
        "磅 (中骨骼型)": "62-67",
        "磅 (大骨骼型)": "66-73"
    },
    {
        "厘米": 177.5,
        "磅 (小骨骼型)": "60-65",
        "磅 (中骨骼型)": "64-69",
        "磅 (大骨骼型)": "68-74"
    },
    {
        "厘米": 180.0,
        "磅 (小骨骼型)": "63-68",
        "磅 (中骨骼型)": "65-71",
        "磅 (大骨骼型)": "70-75"
    },
    {
        "厘米": 182.5,
        "磅 (小骨骼型)": "61-66",
        "磅 (中骨骼型)": "67-73",
        "磅 (大骨骼型)": "72-77"
    }
]

const 骨骼量 = [
    {
        '手腕圓周的粗幼': '小骨骼型',
        '男性': '6.5吋 或 以下',
        '女性': '5.5吋 或 以下',
    },
    {
        '手腕圓周的粗幼': '中骨骼型',
        '男性': '6.5吋 至 7.0吋',
        '女性': '5.5吋 至 6.5吋',
    },
    {
        '手腕圓周的粗幼': '大骨骼型',
        '男性': '7.0吋 或 以上',
        '女性': '6.5吋 或 以上',
    },
]

function BMIPage() {
    return (
        <section className="mb-5">
            <h2>BMI</h2>
            <Card className="mb-3">
                <Card.Body>
                    <Card.Title>快速計算</Card.Title>
                    <BMIForm />
                    <WeightForm />
                </Card.Body>
            </Card>
            <Card className="mb-3">
                <Card.Body>
                    <Card.Title>體重指數</Card.Title>
                    <Datatable data={體重指數} />
                    <p>專家指出最理想的體重指數是22</p>
                </Card.Body>
            </Card>
            <Card className="mb-3">
                <Card.Body>
                    <Datatable data={骨骼量} /><br/><hr/>
                    <Card.Title>男性理想體重表</Card.Title>
                    <Datatable data={男性理想體重表} /><br/><hr/>
                    <Card.Title>女性理想體重表</Card.Title>
                    <Datatable data={女性理想體重表} />
                </Card.Body>
            </Card>
        </section>
    );
}

export default BMIPage;