import { Card } from 'react-bootstrap'
import Datatable from "../components/ui/Datatable";
import BMIForm from '../components/calories/BMIForm';

const 體重指數 = [
    {
        '': '過輕',
        '男性': '低於20',
        '女性': '低於19'
    },
    {
        '': '適中',
        '男性': '20-25',
        '女性': '19-24'
    },
    {
        '': '過重',
        '男性': '26-30',
        '女性': '25-29'
    },
    {
        '': '肥胖',
        '男性': '30-35',
        '女性': '29-34'
    },
    {
        '': '非常肥胖',
        '男性': '高於35',
        '女性': '高於34'
    },
]

const 女性理想體重表 = [
    {
        "厘米": 150.0,
        "磅 (小骨骼型)": "86-96",
        "磅 (中骨骼型)": "88-98",
        "磅 (大骨骼型)": "96-106"
    },	
    {
        "厘米": 152.5,
        "磅 (小骨骼型)": "88-98",
        "磅 (中骨骼型)": "92-102",
        "磅 (大骨骼型)": "100-110"
    },	
    {
        "厘米": 155.0,
        "磅 (小骨骼型)": "90-100",
        "磅 (中骨骼型)": "96-106",
        "磅 (大骨骼型)": "104-114"
    },	
    {
        "厘米": 157.5,
        "磅 (小骨骼型)": "94-104",
        "磅 (中骨骼型)": "100-110",
        "磅 (大骨骼型)": "108-118"
    },	
    {
        "厘米": 160.0,
        "磅 (小骨骼型)": "98-108",
        "磅 (中骨骼型)": "104-114",
        "磅 (大骨骼型)": "112-122"
    },	
    {
        "厘米": 162.5,
        "磅 (小骨骼型)": "102-112",
        "磅 (中骨骼型)": "108-118",
        "磅 (大骨骼型)": "116-126"
    },	
    {
        "厘米": 165.0,
        "磅 (小骨骼型)": "106-116",
        "磅 (中骨骼型)": "112-122",
        "磅 (大骨骼型)": "120-130"
    },	
    {
        "厘米": 167.5,
        "磅 (小骨骼型)": "100-120",
        "磅 (中骨骼型)": "116-126",
        "磅 (大骨骼型)": "124-134"
    },	
    {
        "厘米": 170.0,
        "磅 (小骨骼型)": "104-124",
        "磅 (中骨骼型)": "120-130",
        "磅 (大骨骼型)": "128-38"
    },	
    {
        "厘米": 172.5,
        "磅 (小骨骼型)": "108-128",
        "磅 (中骨骼型)": "124-134",
        "磅 (大骨骼型)": "132-142"
    },	
    {
        "厘米": 175.0,
        "磅 (小骨骼型)": "102-132",
        "磅 (中骨骼型)": "128-138",
        "磅 (大骨骼型)": "136-146"
    },	
    {
        "厘米": 177.5,
        "磅 (小骨骼型)": "106-136",
        "磅 (中骨骼型)": "132-142",
        "磅 (大骨骼型)": "140-150"
    },	
    {
        "厘米": 180.0,
        "磅 (小骨骼型)": "100-140",
        "磅 (中骨骼型)": "136-146",
        "磅 (大骨骼型)": "144-155"
    },	    
]

const 男性理想體重表 = [
    {	
        '厘米': 170.0,
        '磅 (小骨骼型)': '122-132',
        '磅 (中骨骼型)': '128-140',
        '磅 (大骨骼型)': '136-151',
    },
    {	
        '厘米': 172.5,
        '磅 (小骨骼型)': '126-136',
        '磅 (中骨骼型)': '132-144',
        '磅 (大骨骼型)': '140-155',
    },
    {	
        '厘米': 175.0,
        '磅 (小骨骼型)': '130-140',
        '磅 (中骨骼型)': '136-148',
        '磅 (大骨骼型)': '145-160',
    },
    {	
        '厘米': 177.5,
        '磅 (小骨骼型)': '134-144',
        '磅 (中骨骼型)': '140-152',
        '磅 (大骨骼型)': '149-162',
    },
    {	
        
        '厘米': 180.0,
        '磅 (小骨骼型)': '138-148',
        '磅 (中骨骼型)': '144-156',
        '磅 (大骨骼型)': '154-166',
    },
    {	
        '厘米': 182.5,
        '磅 (小骨骼型)': '142-152',
        '磅 (中骨骼型)': '148-160',
        '磅 (大骨骼型)': '158-170',
    },    
]

const 骨骼量 = [
    {
        '手腕圓周的粗幼': '小骨骼型',
        '男性': '6.5吋 或 以下',
        '女性': '5.5吋 或 以下',
    },
    {
        '手腕圓周的粗幼': '中骨骼型',
        '男性': '6.5吋 至 7.0吋',
        '女性': '5.5吋 至 6.5吋',
    },
    {
        '手腕圓周的粗幼': '大骨骼型',
        '男性': '7.0吋 或 以上',
        '女性': '6.5吋 或 以上',
    },
]

function BMIPage() {
    return (
        <section className="mb-5">
            <h2>BMI</h2>
            <Card className="mb-3">
                <Card.Body>
                    <Card.Title>快速計算</Card.Title>
                    <BMIForm />
                </Card.Body>
            </Card>
            <Card className="mb-3">
                <Card.Body>
                    <Card.Title>體重指數</Card.Title>
                    <Datatable data={體重指數} />
                    <p>專家指出最理想的體重指數是22</p>
                </Card.Body>
            </Card>
            <Card className="mb-3">
                <Card.Body>
                    <Datatable data={骨骼量} /><br/><hr/>
                    <Card.Title>男性理想體重表</Card.Title>
                    <Datatable data={男性理想體重表} /><br/><hr/>
                    <Card.Title>女性理想體重表</Card.Title>
                    <Datatable data={女性理想體重表} />
                </Card.Body>
            </Card>
        </section>
    );
}

export default BMIPage;